import os
from FundCodeCrawler import FundCodeCrawler
from FundInfoCrawler import FundInfoCrawler

if not os.path.exists('./data'):
    os.mkdir('./data')

# 所有板块
"""
'贵金属', '环保设备', '黄金概念', '通用设备', '石油石化', 'OLED', '燃料电池', '军工', '专用设备', '军民融合', '大飞机', 
'其他电源设备', '中芯概念', '机械设备', '纺织服饰', '新能源', '第三代半导体', '节能环保', '国产芯片', '航空装备', '化学原料', 
'北斗导航', '社保重仓', '基本金属', '5G概念', '纺织制造', '新能源车', '化学制品', '盐湖提锂', '储能', '苹果概念', '贬值受益', 
'新材料', '光伏设备', '充电桩', '基础化工', '国防军工', '深圳特区', '物联网', '油气设服', '华为概念', '通信服务', '预盈预增', 
'机构重仓', '移动支付', '锂电池', '预亏预减', '创投', '风能', '数据中心', '通用航空', 'QFII重仓', '环保', '人工智能', '稀缺资源', 
'智能穿戴', '举牌', '次新股', '融资融券', '特斯拉', '转债标的', '国企改革', '注册制次新股', '超清视频', '小金属', '通信', '煤化工', 
'区块链', '元宇宙概念', '半导体', '成渝特区', '券商概念', '深股通', '综合', '电子', '电商概念', '互联金融', '网络安全', '乡村振兴', 
'边缘计算', '独角兽', '建筑装饰', '通信设备', '家用电器', '云计算', '汽车芯片', '轻工制造', '中字头', '参股银行', '证券', '百元股', 
'中证500', '公用事业', '农业种植', '上证380', '标准普尔', '养老概念', '化妆品概念', '富时罗素', '航天装备', '医疗美容', '免税概念', 
'统一大市场', '深成500', '影视概念', '跨境支付', '元件', '沪股通', '健康中国', '商业贸易', '有色金属', '钢铁', '非银金融', '基金重仓', 
'银行', '房地产开发', 'AH股', '猪肉概念', '证金持股', '房地产', '风电设备', '中药概念', '基础建设', '电力设备', '建筑材料', 'MSCI中国', 
'央视50', '化学制药', 'IT服务', '消费电子', '传媒', '医疗器械', 'CRO', '农林牧渔', '上证180', '创业成份', '汽车零部件', '计算机', '流感', 
'HS300', '生物疫苗', '美容护理', '调味品概念', '转基因', '上证50', '汽车', '煤炭', '交通运输', '中药', '超级品牌', '医药生物', '生物制品', 
'白色家电', '保险', '固态电池', '软件开发', '航空机场', '房地产服务', '白酒', '食品饮料', '宁组合', '茅指数', '电池', '能源金属', '装修建材', 
'乘用车', '医疗服务'
"""

# 按照板块爬取天天基金网基金代码
# 参数：板块名称，页数（一页10个）
fundCodeCraw = FundCodeCrawler()
plateCode = fundCodeCraw.craw_page('军工',1)

# 爬取板块基金净值信息
fundInfoCraw = FundInfoCrawler(plateCode)
fundInfoCraw.getFundTrain()